{
    "common": {
        "name": "senec",
        "version": "1.3.4",
        "news": {
			"1.3.4": {
				"en": "Moved from request to axios, Added more state attributes (if you have updated descriptions or anything, please open an issue!)",
				"de": "Poll von request zu axios geändert, weitere Zustandsattribute hinzugefügt (wenn Sie aktuellere Beschreibungen, ... haben, bitte issue auf GitHub eröffnen!)",
				"ru": "Перемещено из запроса в аксиомы, добавлено больше атрибутов состояния (если вы обновили описания или что-то еще, пожалуйста, откройте проблему!)",
				"pt": "Movido de solicitação para axios, Adicionado mais atributos de estado (se você atualizou as descrições ou qualquer coisa, abra um problema!)",
				"nl": "Verplaatst van verzoek naar axios, meer statusattributen toegevoegd (als je beschrijvingen hebt bijgewerkt of iets dergelijks, open dan een probleem!)",
				"fr": "Déplacé de la demande vers axios, Ajout de plus d'attributs d'état (si vous avez des descriptions mises à jour ou quoi que ce soit, veuillez ouvrir un problème !)",
				"it": "Spostato da richiesta ad axios, Aggiunti più attributi di stato (se hai descrizioni aggiornate o altro, apri un problema!)",
				"es": "Se movió de solicitud a axios, se agregaron más atributos de estado (si tiene descripciones actualizadas o algo así, ¡abra un problema!)",
				"pl": "Przeniesiono z żądania do axios, dodano więcej atrybutów stanu (jeśli zaktualizowałeś opisy lub cokolwiek, otwórz zgłoszenie!)",
				"zh-cn": "从 request 移到 axios，添加了更多状态属性（如果您有更新的描述或任何内容，请打开一个问题！）"
			},
			"1.3.3": {
				"en": "Update to current template.",
				"de": "Update auf aktuelles Template.",
				"ru": "Обновите текущий шаблон.",
				"pt": "Atualize para o modelo atual.",
				"nl": "Update naar huidige sjabloon.",
				"fr": "Mettre à jour le modèle actuel.",
				"it": "Aggiorna al modello corrente.",
				"es": "Actualizar a la plantilla actual.",
				"pl": "Zaktualizuj do bieżącego szablonu.",
				"zh-cn": "更新到当前模板。"
			},
			"1.3.2": {
				"en": "Autarky without decimal places (again) or they would cause too many updates that are irrelevant especially when considering precision. Values also won't reset to 0 at change of timeframe (day, week, ...) anymore. They are calculated based on reference values anyways. Ensuring that only values meant to be changeable by user are defined so (attribute changes upon the next update of value)",
				"de": "Autarkie (wieder) ohne Dezimalstellen, da sie mehr Updates verursachen, als wirklich benötigt werden (insbesondere im Rahmen der Rundungsgenauigkeiten). Auch werden die Werte bei Änderung des Zeitrahmens (Tag, Woche, ...) nicht mehr forciert auf 0 zurückgesetzt, da sie ohnehin anhand von Referenzwerten berechnet werden. Es wird auch sichergestellt, dass nur Werte geändert werden können, die vom Benutzer geändert werden sollen (Attributänderungen bei der nächsten Wertaktualisierung).",
				"ru": "Автаркия без десятичных знаков (опять же). Они вызывают больше обновлений, чем нам действительно нужно. Значения автарки больше не сбрасываются на 0 при смене таймфрейма (день, неделя, ...). В любом случае они рассчитываются на основе справочных значений. Обеспечение того, чтобы были определены только значения, которые должны быть изменены пользователем (атрибут изменяется при следующем обновлении значения)",
				"pt": "Autarquia sem casas decimais (novamente). Eles estão causando mais atualizações do que realmente precisamos. Os valores da Autarky não serão mais zerados na mudança do período (dia, semana, ...). Eles são calculados com base em valores de referência de qualquer maneira. Garantir que apenas os valores que devem ser alterados pelo usuário sejam definidos assim (alterações de atributo na próxima atualização de valor)",
				"nl": "Autarkie zonder decimalen (opnieuw). Ze zorgen voor meer updates dan we echt nodig hebben. Autarky-waarden worden niet meer gereset naar 0 bij verandering van tijdsbestek (dag, week, ...). Ze worden sowieso berekend op basis van referentiewaarden. Ervoor zorgen dat alleen waarden die bedoeld zijn om door de gebruiker te kunnen worden gewijzigd, zo worden gedefinieerd (attribuut verandert bij de volgende update van waarde)",
				"fr": "Autarcie sans décimales (encore une fois). Ils provoquent plus de mises à jour que ce dont nous avons vraiment besoin. Les valeurs d'autarcie ne seront plus remises à 0 lors du changement de la période (jour, semaine, ...). Ils sont de toute façon calculés sur la base des valeurs de référence. S'assurer que seules les valeurs censées être modifiables par l'utilisateur sont définies ainsi (l'attribut change lors de la prochaine mise à jour de la valeur)",
				"it": "Autarchia senza cifre decimali (di nuovo). Stanno causando più aggiornamenti di quelli di cui abbiamo veramente bisogno. I valori di autarchia non si resetteranno più a 0 al cambio del periodo di tempo (giorno, settimana, ...). Sono comunque calcolati sulla base dei valori di riferimento. Garantire che solo i valori che devono essere modificabili dall'utente siano definiti in questo modo (l'attributo cambia al successivo aggiornamento del valore)",
				"es": "Autarquía sin decimales (de nuevo). Están provocando más actualizaciones de las que realmente necesitamos. Los valores de autarquía ya no se restablecerán a 0 al cambiar el período de tiempo (día, semana, ...). De todos modos, se calculan sobre la base de valores de referencia. Asegurarse de que solo se definan así los valores que el usuario puede cambiar (el atributo cambia en la próxima actualización del valor)",
				"pl": "Autarkia bez miejsc dziesiętnych (ponownie). Powodują więcej aktualizacji, niż naprawdę potrzebujemy. Wartości autarkii nie będą już resetowane do 0 przy zmianie przedziału czasowego (dzień, tydzień, ...). Są one i tak obliczane na podstawie wartości referencyjnych. Zapewnienie, że tylko wartości, które mają być zmieniane przez użytkownika, są tak zdefiniowane (atrybut zmienia się przy następnej aktualizacji wartości)",
				"zh-cn": "再次没有小数位的Autarky。它们造成的更新超出了我们的实际需要。 Autarky值将不会在时间范围（天，周，...）更改时重置为0。无论如何，它们都是基于参考值计算的。确保仅定义要由用户更改的值（在值的下一次更新时归因于更改）"
			},
			"1.3.1": {
				"en": "(NoBl) Added calculation of autarky for day/week/month/year",
				"de": "(NoBl) Berechnung der Autarkie für Tag / Woche / Monat / Jahr hinzugefügt",
				"ru": "(NoBl) Добавлен расчет автаркии на день / неделю / месяц / год",
				"pt": "(NoBl) Adicionado cálculo de autarquia para dia / semana / mês / ano",
				"nl": "(NoBl) Berekening van autarkie toegevoegd voor dag / week / maand / jaar",
				"fr": "(NoBl) Ajout du calcul de l'autarcie pour jour / semaine / mois / année",
				"it": "(NoBl) Aggiunto il calcolo dell'autarchia per giorno / settimana / mese / anno",
				"es": "(NoBl) Cálculo agregado de autarquía para día / semana / mes / año",
				"pl": "(NoBl) Dodano obliczanie autarkii dla dnia / tygodnia / miesiąca / roku",
				"zh-cn": "（NoBl）添加了针对日/周/月/年的自给自足计算"
			},
			"1.3.0": {
				"en": "(NoBl) Rewrote translations handling and added translations for wallbox status. Translated status get an extra datapoint with _Text as postfix. Former translations that didn't add an extra dp will now revert to their numeric representation and add the _Text DP. translations are now handled via lib/state_trans.js for all 3 languages available in the senec system (german, english, italian).",
				"de": "(NoBl) Übersetzungshandling neu designed und Übersetzungen für den Wallbox-Status hinzugefügt. Der übersetzte Status erhält einen zusätzlichen Datenpunkt mit _Text als Postfix. Frühere Übersetzungen ohne zusätzlichen DP werden auf ihren numerischen Wert zurückgesetzt und es wird der DP mit Postfix ergänzt. Übersetzungen werden jetzt über lib / state_trans.js für alle 3 im senec-System verfügbaren Sprachen (Deutsch, Englisch, Italienisch) abgewickelt.",
				"ru": "(NoBl) Переписана обработка переводов и добавлены переводы для статуса wallbox. Переведенный статус получает дополнительную точку данных с _Text в качестве постфикса. Прежние переводы, которые не добавляли дополнительный dp, теперь вернутся к своему числовому представлению и добавят _Text DP. переводы теперь выполняются через lib / state_trans.js для всех 3 языков, доступных в системе senec (немецкий, английский, итальянский).",
				"pt": "(NoBl) Manipulação de traduções reescritas e traduções adicionadas para status de wallbox. O status traduzido obtém um ponto de dados extra com _Text como postfix. As traduções anteriores que não adicionaram um dp extra irão agora reverter para sua representação numérica e adicionar o _Text DP. as traduções agora são feitas via lib / state_trans.js para todos os 3 idiomas disponíveis no sistema senec (alemão, inglês, italiano).",
				"nl": "(NoBl) Verwerking van vertalingen herschreven en vertalingen toegevoegd voor wallbox-status. De vertaalde status krijgt een extra datapunt met _Text als postfix. Voormalige vertalingen die geen extra dp hebben toegevoegd, zullen nu terugkeren naar hun numerieke weergave en de _Text DP toevoegen. vertalingen worden nu afgehandeld via lib / state_trans.js voor alle 3 talen die beschikbaar zijn in het senec-systeem (duits, engels, italiaans).",
				"fr": "(NoBl) Réécriture de la gestion des traductions et ajout de traductions pour le statut de la wallbox. Le statut traduit obtient un point de données supplémentaire avec _Text comme suffixe. Les anciennes traductions qui n'ajoutaient pas de dp supplémentaire reviendront maintenant à leur représentation numérique et ajouteront le _Text DP. les traductions sont désormais gérées via lib / state_trans.js pour les 3 langues disponibles dans le système senec (allemand, anglais, italien).",
				"it": "(NoBl) Gestione delle traduzioni riscritta e traduzioni aggiunte per lo stato della wallbox. Lo stato tradotto ottiene un datapoint aggiuntivo con _Text come suffisso. Le precedenti traduzioni che non aggiungevano un dp extra torneranno ora alla loro rappresentazione numerica e aggiungeranno _Text DP. le traduzioni sono ora gestite tramite lib / state_trans.js per tutte e 3 le lingue disponibili nel sistema senec (tedesco, inglese, italiano).",
				"es": "(NoBl) Reescribió el manejo de traducciones y agregó traducciones para el estado de wallbox. El estado traducido obtiene un punto de datos adicional con _Text como sufijo. Las traducciones anteriores que no agregaron un dp adicional ahora volverán a su representación numérica y agregarán el _Text DP. las traducciones ahora se manejan a través de lib / state_trans.js para los 3 idiomas disponibles en el sistema senec (alemán, inglés, italiano).",
				"pl": "(NoBl) Przepisano obsługę tłumaczeń i dodano tłumaczenia dla statusu Wallbox. Status przetłumaczony otrzymuje dodatkowy punkt danych z _Textem jako postfiksem. Wcześniejsze tłumaczenia, które nie dodały dodatkowego dp, teraz powrócą do swojej reprezentacji numerycznej i dodają _Text DP. tłumaczenia są teraz obsługiwane przez lib / state_trans.js dla wszystkich 3 języków dostępnych w systemie senec (niemiecki, angielski, włoski).",
				"zh-cn": "（NoBl）重新编写了翻译处理并添加了关于墙盒状态的翻译。转换后的状态以_Text作为后缀获得一个额外的数据点。以前没有添加额外dp的翻译现在将恢复为其数字表示形式，并添加_Text DP。现在可以通过lib / state_trans.js处理senec系统中所有3种语言（德语，英语，意大利语）的翻译。"
			},
			"1.2.0": {
				"en": "(NoBl) Added datapoints for: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (please report wrong / missing units).;  Adapter now calculates day/week/month/year-values for: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_DISCHARGE_MASTER. Calculated values can be found below the _calc. datapoint. Information about daily values was removed from the API by SENEC in the past. So here we go again ...",
				"de": "(NoBl) Datenpunkte hinzugefügt für: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, STECKDOSEN, CASC, WALLBOX, CONNX50, STECA (bitte falsche / fehlende Einheiten melden); Der Adapter berechnet jetzt Tag / Woche / Monat / Jahr-Werte für: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC_L_. Berechnete Werte befinden sich unter dem _calc. Datenpunkt. Informationen zu Tageswerten wurden in der Vergangenheit von SENEC aus der API entfernt. Jetzt sind sie wieder da ...",
				"ru": "(NoBl) Добавлены точки данных для: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (сообщите неправильные / отсутствующие блоки) .; Теперь адаптер вычисляет значения дня / недели / месяца / года для: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER_MASTER_DISCHARGE_MASTER_MASTER_STATISTIC_BAT_CHARGE_MASTER_MASTER_SCHARGE_MASTER_MASTER_SCHARGE_MASTER_SCHARGE_MASTER_SCHARGE_MASTER_SCHARGE_MASTER. Расчетные значения можно найти под _calc. датапоинт. Информация о ежедневных значениях была удалена из API SENEC в прошлом. Итак, мы снова ...",
				"pt": "(NoBl) Adicionados pontos de dados para: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (relatar unidades erradas / ausentes) .; O adaptador agora calcula os valores de dia / semana / mês / ano para: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_DISCHAR. Os valores calculados podem ser encontrados abaixo de _calc. datapoint. As informações sobre os valores diários foram removidas da API pelo SENEC no passado. Então, aqui vamos nós outra vez ...",
				"nl": "(NoBl) Datapunten toegevoegd voor: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (gelieve verkeerde / ontbrekende eenheden te melden) .; Adapter berekent nu dag / week / maand / jaar-waarden voor: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC_MASTER. Berekende waarden zijn te vinden onder de _calc. data punt. Informatie over dagelijkse waarden is in het verleden door SENEC uit de API verwijderd. Dus hier gaan we weer ...",
				"fr": "(NoBl) Ajout de points de données pour: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (veuillez signaler les unités erronées / manquantes); L'adaptateur calcule désormais les valeurs jour / semaine / mois / année pour: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISGE_BISGEMASTER. Les valeurs calculées se trouvent sous le _calc. point de données. Les informations sur les valeurs quotidiennes ont été supprimées de l'API par le SENEC dans le passé. Donc, nous y revoilà ...",
				"it": "(NoBl) Aggiunti datapoint per: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (si prega di segnalare unità errate / mancanti) .; L'adattatore ora calcola i valori giorno / settimana / mese / anno per: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BAT_DISCHARGE_MASTER. I valori calcolati possono essere trovati sotto _calc. datapoint. Le informazioni sui valori giornalieri sono state rimosse dall'API da SENEC in passato. Quindi eccoci di nuovo ...",
				"es": "(NoBl) Se agregaron puntos de datos para: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (informe las unidades incorrectas / faltantes); El adaptador ahora calcula los valores de día / semana / mes / año para: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER, STATISTIC.LIVE_BARGE_DISTER, STATISTIC.LIVE_BARGE_DISTER. Los valores calculados se pueden encontrar debajo de _calc. punto de datos. La información sobre los valores diarios fue eliminada de la API por SENEC en el pasado. Aquí vamos de nuevo ...",
				"pl": "(NoBl) Dodano punkty danych dla: PM1OBJ1, PM1OBJ2, EG_CONTROL, RTC, PM1, TEMPMEASURE, DEBUG, SOCKETS, CASC, WALLBOX, CONNX50, STECA (proszę zgłosić błędne / brakujące jednostki) .; Adapter oblicza teraz wartości dzień / tydzień / miesiąc / rok dla: STATISTIC.LIVE_GRID_EXPORT, STATISTIC.LIVE_GRID_IMPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MAPORT, STATISTIC.LIVE_HOUSE_CONS, STATISTIC.LIVE_PV_GEN, STATISTIC.LIVE_BAT_CHARGE_MASTER_BATISTIC_STERMADIS. Obliczone wartości można znaleźć poniżej _calc. punkt danych. Informacje o wartościach dziennych zostały w przeszłości usunięte z API przez SENEC. Więc zaczynamy znowu ...",
				"zh-cn": "（NoBl）添加了以下数据点：PM1OBJ1，PM1OBJ2，EG_CONTROL，RTC，PM1，TEMPMEASURE，DEBUG，SOCKETS，CASC，WALLBOX，CONNX50，STECA（请报告错误/丢失的单元）。适配器现在为以下日期计算日/周/月/年值：STATISTIC.LIVE_GRID_EXPORT，STATISTIC.LIVE_GRID_IMPORT，STATISTIC.LIVE_HOUSE_CONS，STATISTIC.LIVE_PV_GEN，STATISTIC.LIVE_BAT_CHARGE_MASTER，STATISTIC.LIVE_BAT_DISCHARGE_MASTER。计算值可以在_calc下面找到。数据点。过去，SENEC已从API中删除了有关每日值的信息。所以我们再来一次..."
			}
        },
        "docs": {
            "en": "docs/en/README.md",
            "de": "docs/de/README.md"
        },
        "title": "Senec",
        "titleLang": {
            "en": "Senec",
            "de": "Senec",
            "ru": "Senec",
            "pt": "Senec",
            "nl": "Senec",
            "fr": "Senec",
            "it": "Senec",
            "es": "Senec",
            "pl": "Senec",
            "zh-cn": "塞内克"
        },
        "desc": {
            "en": "This adapter reads available values from a Senec Home V2.1 system using lala.cgi.",
            "de": "Dieser Adapter liest die in einem Senec Home V2.1 verfügbaren Werte via lala.cgi aus."
        },
        "authors": [
            "NoBl <github@bluemle.org>"
        ],
        "keywords": [
            "iobroker",
            "senec",
            "solar"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "senec.png",
        "enabled": false,
        "extIcon": "https://raw.githubusercontent.com/nobl/ioBroker.senec/master/admin/senec.png",
        "readme": "https://github.com/nobl/ioBroker.senec/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "energy",
		"connectionType": "local",
	    "dataSource": "poll",
		"compact": true,
		"materialize": true,
		"materializeTab": false,
		"adminTab": {
            "singleton": true,
            "name": {
                "en": "Senec (JavaScript)",
                "de": "Senec (JavaScript)",
                "ru": "Senec (JavaScript)",
                "pt": "Senec (JavaScript)",
                "nl": "Senec (JavaScript)",
                "fr": "Senec (JavaScript)",
                "it": "Senec (JavaScript)",
                "es": "Senec (JavaScript)",
                "pl": "Senec (JavaScript)",
                "zh-cn": "塞内克 (JavaScript)"
            },
            "link": "",
            "fa-icon": "info"
        },
		"supportCustoms": false,
        "dependencies": [
			{
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "senecip": "0.0.0.0",
        "interval": 10,
		"intervalLow": 60,
		"pollingTimeout": 5000,
		"retries": 10,
		"retrymultiplier": 2
    },
    "objects": [],
    "instanceObjects": [{
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        }, {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Device or service connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
