{
  "common": {
    "name": "senec",
    "version": "2.3.0",
    "news": {
      "2.3.0": {
        "en": "Measurements for today and yesterday are also available by the hour\nMeasurements for month and previous month are also available by day\nMeasurements for year are also available by month\nUnit calculation fixed if we don't know the unit yet per state_attr.js\nAdded definitions for cascadeDevicesCount and mode\nDependency update",
        "de": "Messungen für heute und gestern sind auch in der Stunde verfügbar\nMessungen für Monat und Vormonat sind auch tagsüber verfügbar\nMessungen für das Jahr sind auch monatlich verfügbar\nEinheitsberechnung behoben, wenn wir die Einheit noch nicht pro state_attr.js kennen\nHinzugefügt Definitionen für KaskadeDevicesCount und Modus\nÄnderung der Abhängigkeit",
        "ru": "Измерения на сегодня и вчера также доступны по часам\nИзмерения за месяц и предыдущий месяц также доступны по дням\nИзмерения за год также доступны по месяцам\nРасчет единицы фиксируется, если мы еще не знаем единицу для состояния_attr.js\nДобавлены определения для каскадаРасчет и режим\nОбновление зависимостей",
        "pt": "As medições de hoje e de ontem também estão disponíveis por hora\nMedidas para mês e mês anterior também estão disponíveis por dia\nAs medições para o ano também estão disponíveis por mês\nCálculo unitário corrigido se ainda não soubermos a unidade por state_attr.js\nDefinições adicionadas para dispositivos em cascataCount and mode\nActualização da dependência",
        "nl": "Metingen voor vandaag en gisteren zijn ook beschikbaar per uur\nMetingen voor maand en vorige maand zijn ook beschikbaar per dag\nMetingen voor jaar zijn ook beschikbaar per maand\nEenheidsberekening vastgesteld als we de eenheid nog niet kennen per state_attr.js\nToegevoegde definities voor cascadeDevicesTelling en modus\nAfhankelijkheidsupdate",
        "fr": "Les mesures pour aujourd'hui et hier sont également disponibles à l'heure\nLes mesures pour le mois et le mois précédent sont également disponibles par jour\nLes mesures pour l'année sont également disponibles par mois\nCalcul unitaire corrigé si nous ne connaissons pas encore l'unité par état_attr.js\nAjout de définitions pour cascadeDevicesCount et mode\nMise à jour de la dépendance",
        "it": "Le misure di oggi e di ieri sono disponibili anche entro l'ora\nLe misure per il mese e il mese precedente sono disponibili anche di giorno\nLe misure per l'anno sono disponibili anche per mese\nCalcolo dell'unità fissato se non conosciamo l'unità ancora per state_attr.js\nDefinizioni aggiuntive per cascadeDevicesCount e modalità\nAggiornamento della dipendenza",
        "es": "Las medidas para hoy y ayer también están disponibles por hora\nLas mediciones para mes y mes anterior también están disponibles por día\nLas mediciones del año también están disponibles por mes\nCálculo de unidad fijo si no conocemos la unidad todavía por state_attr.js\nDefiniciones agregadas para cascadaDispositivosCounto y modo\nActualización de la dependencia",
        "pl": "Pomiary na dziś i wczoraj są również dostępne w ciągu godziny\nPomiary za miesiąc i miesiąc poprzedni są również dostępne w ciągu dnia\nPomiary na rok są również dostępne w miesiącu\nObliczanie jednostki ustalone, jeśli nie znamy jeszcze jednostki na stan _ attr.js\nDodano definicje dla cascadeDevicesCount and mode\nAktualizacja zależności",
        "uk": "Вимірювання на сьогодні і сьогодні також доступні за годину\nВимірювання протягом місяця та попереднього місяця також доступні за днем\nВимірювання за рік також доступні за місяць\nОбчислення агрегату зафіксовано, якщо ми не знаємо блок, але за стан_attr.js\nДодано визначення для каскаднихDevicesCount та режим\nОновлення залежності",
        "zh-cn": "今天和昨天的测量也按小时提供\n每月和上月的计量也按日提供\n还按月提供年度计量数据\n如果我们还不知道每个状态的单位, 单位计算会固定\n级联DevicesCount和模式的添加定义\n依赖性更新"
      },
      "2.2.2": {
        "en": "Migrated to i18n\nUpdate handling of \"new\" states that are just an \"extra\" to an existing state like state and state.1 or state.42\nDependency Updates",
        "de": "Migration auf i18n\nUpdate-Handling von \"neuen\" Zuständen, die nur ein \"Extra\" zu einem bestehenden Zustand wie Staat und Staat sind. 1 oder Zustand. ANHANG\nDependance-Updates",
        "ru": "Иммиграция в i18n\nОбновление обработки «новых» состояний, которые являются просто «дополнительными» к существующему состоянию. 1 или государство. 42\nОбновления зависимостей",
        "pt": "Migrado para i18n\nAtualizar o manuseio de estados \"novos\" que são apenas um \"extra\" para um estado existente como estado e estado. 1 ou estado. 42\nAtualizações de Dependência",
        "nl": "Migreren naar i18n\nUpdate de behandeling van \"nieuwe\" staten die slechts een \"extra\" zijn naar een bestaande staat zoals staat en staat. 1 of staat. 42\nAfhankelijkheidsupdates",
        "fr": "Migrés en i18n\nMettre à jour la gestion des états « nouveaux » qui ne sont qu'un « extra » à un état existant comme l'état et l'état. 1 ou état. Annexe\nMises à jour sur la dépendance",
        "it": "Migrato a i18n\nGestione dell'aggiornamento di \"nuovi\" stati che sono solo un \"extra\" a uno stato esistente come stato e stato. 1 o stato. 42, 42, 42, 42\nAggiornamenti di dipendenza",
        "es": "Migrado a i18n\nActualizar el manejo de estados \"nuevos\" que son sólo un \"extra\" a un estado existente como estado y estado. 1 o estado. 42\nActualizaciones de dependencia",
        "pl": "Migrant to i18n\nAktualizacja obsługi \"nowych\" stanów, które są tylko \"dodatkowe\" do istniejącego stanu, jak stan i stan. 1 lub stan. 42\nAktualizacje zależności",
        "uk": "Міграція до i18n\nОновити обробку \"нових\" станів, які просто \"екстра\" до існуючого стану, як держави, так і держави. 1 або держава. 42 км\nОновлення залежності",
        "zh-cn": "迁移到 i18n\n更新\"新\"状态的处理方式,这些状态只是像州和州这样的现有状态的\"外\". 1或为州. 第42条\n依赖性更新"
      },
      "2.2.1": {
        "en": "Fixed: History rebuild will only run once now when requested (remember: To force rebuild you need to configure this in settings)",
        "de": "Behoben: History rebuild wird nur einmal laufen, wenn gewünscht (Erinnerung: Um den Wiederaufbau zu zwingen, müssen Sie diese in Einstellungen konfigurieren)",
        "ru": "Исправлено: Восстановление истории будет проводиться только один раз сейчас по запросу (помните: Чтобы принудительно перестроить, вам нужно настроить это в настройках",
        "pt": "Corrigido: A reconstrução do histórico só será executada uma vez agora quando solicitado (lembre-se: Para forçar a reconstrução, você precisa configurar isso nas configurações)",
        "nl": "Fixed: Geschiedenis herbouwen zal nu maar één keer draaien op verzoek (onthoud: Om herbouw te forceren moet je dit instellen in instellingen)",
        "fr": "Correction : La reconstruction de l'historique ne s'exécutera qu'une fois sur demande (rappelez-vous : Pour forcer la reconstruction vous devez configurer ceci dans les paramètres)",
        "it": "Risolto: la ricostruzione della storia verrà eseguita solo una volta al momento della richiesta (ricorda: Per forzare la ricostruzione è necessario configurare questo nelle impostazioni)",
        "es": "Arreglado: La reconstrucción de la historia sólo funcionará una vez cuando se solicite (recuerde: Para forzar la reconstrucción necesita configurar esto en la configuración)",
        "pl": "Naprawiono: Odbudowa historii będzie działać tylko raz na życzenie (pamiętaj: Aby wymusić odbudowę musisz skonfigurować to w ustawieniach)",
        "uk": "Виправлено: Історія перебудування буде працювати лише один раз, коли запитаний (замовити: Змусити перебудувати потрібно налаштувати це в налаштуваннях)",
        "zh-cn": "固定: 历史重建只有在接到请求时才会运行一次( 请记住 : 要强制重建, 您需要在设置中配置 )"
      },
      "2.2.0": {
        "en": "Polling yearly measurements as year from API - not months (and summing them up)\nAdded back AllTimeHistory with BATTERY_LEVEL_IN_PERCENT averaged and AUTARKY_IN_PERCENT calculated\nRemoved selection to use https or http for lala.cgi. https is enforced now.",
        "de": "Polling jährlich Messungen als Jahr von API - nicht Monate (und summieren sie nach oben)\nZurück hinzugefügt AllTimeHistory mit BATTERY_LEVEL_IN_PERCENT gemittelt und AUTARKY_IN_PERCENT berechnet\nEntfernte Auswahl zur Verwendung von https oder http für lala.cgi. https wird jetzt durchgesetzt.",
        "ru": "Опрос годовых измерений как год из API - не месяцы (и суммирование их)\nОбновление AllTimeHistory с помощью BATTERY_LEVEL_IN_PERCENT Усредненный и автономный рассчитанный\nУдаленный выбор для использования https или http для lala.cgi. https применяется сейчас.",
        "pt": "Medições anuais de sondagem como ano da API - não meses (e resumi-los)\nHistória de todos os tempos adicionada com BATTERY_LEVEL_IN_PERCENT média e AUTARKY_IN_PERCENT calculado\nA seleção removida para usar https ou http para lala.cgi. https é executada agora.",
        "nl": "Jaarlijkse metingen per jaar van API - geen maanden (en som ze op)\nAlgehele geschiedenis met BATTERY_LEVEL_IN_PERCENT gemiddelde en AUTARKY_IN_PERCENT berekend\nVerwijderde selectie om https of http voor lala.cgi te gebruiken. https wordt nu afgedwongen.",
        "fr": "Sondages sur les mesures annuelles à partir de l'API - pas mois (et les résumer)\nAjouté en arrière AllTimeHistory avec BATTERY_LEVEL_IN_PERCENT moyenne et AUTARRKY_IN_PERCENT calculée\nLa sélection supprimée pour utiliser https ou http for lala.cgi. https est mise en œuvre maintenant.",
        "it": "Inquinare le misure annuali come anno da API - non mesi (e sommarle)\nAggiunto il back AllTimeHistory con BATTERY_LEVEL_IN_PERCENT medio e AUTARKY_IN_PERCENT calcolato\nLa selezione eliminata da utilizzare https o http per lala.cgi. https è ora applicata.",
        "es": "Votar mediciones anuales como año de API - no meses (y resumirlas)\nAñadido atrás Historia de todo el tiempo con BATTERY_LEVEL_IN_PERCENT promedio y AUTARKY_IN_PERCENT calculado\nSelección eliminada para utilizar https o http para lala.cgi. https se aplica ahora.",
        "pl": "Badanie rocznych pomiarów z API - nie miesięcy (i podsumowanie ich)\nDodano AllTimeHistory z BATTERY _ LEVEL _ IN _ PERCENT Uśrednione i AUTARKY _ IN _ PERCENT obliczone\nUsunięty wybór do wykorzystania https lub http dla lala.cgi. https jest teraz egzekwowany.",
        "uk": "Вимірювання протягом року з API - не місяців (і підведення їх)\nДодано зворотний AllTimeHistory з BATTERY_LEVEL_IN_PERCENT Середня та АУАРКИ_IN_PERCENT розрахунок\nВилучено вибір, щоб використовувати HTTPS або HTTP для lala.cgi. https://www.facebook.com.",
        "zh-cn": "按年度按API进行投票,而不是按月(并汇总)\n用 BATTERY_LEVEL_IN_PERCENT 添加回全时历史 平均值和 AUTARKY_IN_PERCENT 计算\n删除用于 lala.cgi 的 https 或 https 选择。 https 现已执行 ."
      },
      "2.1.3": {
        "en": "– reading all previous years (up to inception of SENEC) added again (to make this happen: activate recalculation of full history via settings)\n- added today / yesterday again\n- optimizations for measurements handling\n- less log noise",
        "de": "– Lesen Sie alle Vorjahre (bis zu Beginn der SENEC) erneut hinzugefügt (um dies zu machen: Aktivieren Sie die Neuberechnung der vollen Geschichte über Einstellungen)\n- heute / gestern wieder hinzugefügt\n- optimierungen für messungen\n- weniger log lärm",
        "ru": "- чтение всех предыдущих лет (до создания SENEC) добавлено снова (чтобы это произошло: активируйте пересчет полной истории через настройки)\nдобавлено сегодня / вчера снова\n- оптимизация для обработки измерений\n- меньше бревенчатого шума",
        "pt": "– ler todos os anos anteriores (até o início do SENEC) adicionado novamente (para fazer isso acontecer: ativar o recalculamento do histórico completo através de configurações)\n- adicionado hoje / ontem novamente\n- otimizações para manuseio de medições\n- menos ruído de log",
        "nl": "Het lezen van alle voorgaande jaren (tot het begin van SENEC) opnieuw toegevoegd (om dit te laten gebeuren: activeer herberekening van volledige geschiedenis via instellingen)\n- vandaag toegevoegd / gisteren weer\n- optimalisaties voor metingen\n- minder logruis",
        "fr": "– lecture de toutes les années précédentes (jusqu'à la création du SENEC) ajoutée à nouveau (pour y arriver : activer le recalcul de l'historique complet via les paramètres)\n- ajouté aujourd'hui / hier encore\n- optimisations pour la manipulation des mesures\n- moins de bruit de bûcherons",
        "it": "– lettura di tutti gli anni precedenti (fino all'inizio di SENEC) aggiunto di nuovo (per farlo accadere: attivare il ricalcolo della storia completa attraverso le impostazioni)\n- aggiunto oggi / di nuovo ieri\n- ottimizzazioni per la gestione delle misurazioni\n- meno rumore di log",
        "es": "– leer todos los años anteriores (hasta la creación de SENEC) añadió de nuevo (para hacer que esto suceda: activar la recalculación de la historia completa a través de ajustes)\n- añadido hoy / ayer otra vez\n- optimizaciones para el manejo de mediciones\n- menos ruido de registro",
        "pl": "- czytanie wszystkich poprzednich lat (aż do powstania SENEC) dodano ponownie (aby tak się stało: aktywować ponowne obliczanie pełnej historii za pomocą ustawień)\n- dodany dzisiaj / wczoraj ponownie\n- optymalizacje do obsługi pomiarów\n- mniej hałasu logowania",
        "uk": "– читати всі попередні роки (до вступу до SENEC) додано ще раз (для цього трапляються: активувати перерахунок повної історії через налаштування)\n- додано сьогодні / вчора знову\n- оптимізація обробки вимірювань\n- менше шуму входу",
        "zh-cn": "- 阅读所有往年(直到SENEC的建立)再次添加(为了实现这一点:通过设置激活全部历史的重新计算)\n- 今天/昨天又增加了一个\n- 优化测量处理\n- 别吵了"
      },
      "2.1.2": {
        "en": "more silencing log messages\nhousekeeping",
        "de": "mehr silent-log-nachrichten\nhauswirtschaft",
        "ru": "больше бревенчатых сообщений\nдомашнее хозяйство",
        "pt": "mais mensagens de log silenciando\nserviço de limpeza",
        "nl": "meer logberichten tot zwijgen brengen\nhuishouden",
        "fr": "plus silencieux messages de journal\nménage",
        "it": "più silenziare messaggi di registro\npulizia",
        "es": "más mensajes de registro\nlimpieza",
        "pl": "więcej wiadomości dziennika tłumiącego\nsprzątanie",
        "uk": "більше спильних повідомлень журналу\nприбирання будинків",
        "zh-cn": "更多静音日志消息\n家务"
      },
      "2.1.1": {
        "en": "fixed datatype for WIZARD.SG_READY_CURR_MODE\nless logging (moved some info to debug again)",
        "de": "fester Datentyp für WIZARD.SG_READY_CURR_MODE\nweniger protokollierung (erweitert einige infos zum debug wieder)",
        "ru": "фиксированный тип данных WIZARD.SG_READY_CURR_MODE\nменьше лесозаготовок (перенес некоторую информацию для отладки снова)",
        "pt": "tipo de dados fixo para WIZARD.SG_READY_CURR_MODE\nmenos registro (movi algumas informações para depuração novamente)",
        "nl": "vast datatype voor WIZARD.SG_READY_CURR_MODE\nminder loggen (moved some info to debug again)",
        "fr": "type de données fixe pour WIZARD.SG_READY_CURR_MODE\nmoins d'enregistrement (a déplacé quelques informations pour déboguer à nouveau)",
        "it": "dati fissi per WIZARD.SG_READY_CURR_MODE\nmeno registrazione (spostato alcune informazioni per debug di nuovo)",
        "es": "tipo de datos fijo para WIZARD.SG_READY_CURR_MODE\nmenos logging (moved some info to debug again)",
        "pl": "stały typ danych dla WIZARD.SG _ READY _ CURR _ MODE\nmniej logowania (przesunął niektóre informacje do debugowania ponownie)",
        "uk": "фіксований тип даних для WIZARD.SG_READY_CURR_MODE\nменше зауважень (здійснили додаткову інформацію про відмову)",
        "zh-cn": "wIZARD.SG_READY_CURR_MODE 的固定数据类型\n减少记录( 移动一些信息以再次调试)"
      }
    },
    "docs": {
      "en": "docs/en/README.md",
      "de": "docs/de/README.md"
    },
    "titleLang": {
      "en": "Senec",
      "de": "Senec",
      "ru": "Senec",
      "pt": "Senec",
      "nl": "Senec",
      "fr": "Senec",
      "it": "Senec",
      "es": "Senec",
      "pl": "Senec",
      "uk": "Senec",
      "zh-cn": "塞内克"
    },
    "desc": {
      "en": "This adapter reads available values from a Senec Home V2.1 (and later) system using lala.cgi",
      "de": "Dieser Adapter liest verfügbare Werte von einem Senec Home V2.1 (und später) System mit lala.cgi",
      "ru": "Этот адаптер считывает доступные значения от системы Senec Home V2.1 (и позже) с помощью lala.cgi",
      "pt": "Este adaptador lê valores disponíveis de um sistema Senec Home V2.1 (e posterior) usando lala.cgi",
      "nl": "Deze adapter leest beschikbare waarden van een Senec Home V21 (en later) systeem met lala",
      "fr": "Cet adaptateur lit les valeurs disponibles d'un système Senec Home V2.1 (et plus tard) utilisant lala.cgi",
      "it": "Questo adattatore legge i valori disponibili da un sistema Senec Home V2.1 (e successivamente) utilizzando lala.cgi",
      "es": "Este adaptador lee los valores disponibles de un sistema Senec Home V2.1 (y más tarde) usando lala.cgi",
      "pl": "Ta adapter przeczytała dostępne wartości z systemu Senec Home V2.1 (a później) używając lala.cgi",
      "uk": "Цей адаптер зчитуває доступні значення від Senec Home V2.1 (і пізніше) системи за допомогою lala.cgi",
      "zh-cn": "这种适应者从Senec Home V2.1(和以后)利用Fla.cgi阅读了可使用的数值。"
    },
    "authors": [
      "NoBl <github@bluemle.org>"
    ],
    "keywords": [
      "senec",
      "solar"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "tier": 2,
    "icon": "senec.png",
    "enabled": false,
    "extIcon": "https://raw.githubusercontent.com/nobl/ioBroker.senec/master/admin/senec.png",
    "readme": "https://github.com/nobl/ioBroker.senec/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.20"
      }
    ]
  },
  "native": {
    "lala_use": true,
    "control_active": false,
    "senecip": "0.0.0.0",
    "interval": 10,
    "intervalLow": 60,
    "pollingTimeout": 5000,
    "retries": 10,
    "retrymultiplier": 2,
    "disclaimer": false,
    "highPrio_BMS": "",
    "highPrio_BMS_active": false,
    "highPrio_ENERGY": "",
    "highPrio_ENERGY_active": false,
    "highPrio_PV1": "",
    "highPrio_PV1_active": false,
    "highPrio_PWR_UNIT": "",
    "highPrio_PWR_UNIT_active": false,
    "highPrio_PM1OBJ1": "",
    "highPrio_PM1OBJ1_active": false,
    "highPrio_PM1OBJ2": "",
    "highPrio_PM1OBJ2_active": false,
    "highPrio_WALLBOX": "",
    "highPrio_WALLBOX_active": false,
    "highPrio_BAT1": "",
    "highPrio_BAT1_active": false,
    "highPrio_BAT1OBJ1": "",
    "highPrio_BAT1OBJ1_active": false,
    "highPrio_TEMPMEASURE": "",
    "highPrio_TEMPMEASURE_active": false,
    "api_use": false,
    "api_interval": 5,
    "api_alltimeRebuild": false,
    "api_mail": "",
    "api_pwd": ""
  },
  "encryptedNative": [
    "api_mail",
    "api_pwd"
  ],
  "protectedNative": [
    "api_mail",
    "api_pwd"
  ],
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "control",
      "type": "channel",
      "common": {
        "name": "Control Buttons"
      },
      "native": {}
    },
    {
      "_id": "control.ForceLoadBattery",
      "type": "state",
      "common": {
        "role": "switch",
        "name": "Force Load Battery",
        "type": "boolean",
        "read": true,
        "write": true,
        "def": false
      },
      "native": {}
    }
  ]
}
