{
    "common": {
        "name": "senec",
        "version": "1.3.8",
        "news": {
			"1.3.8": {
				"en": "Removed (unnecessary) admin tab.",
				"de": "(Unnötigen) Admin-Tab entfernt.",
				"ru": "Удаленная (необходимая) админ таб.",
				"pt": "Removido (desnecessário) guia de administração.",
				"nl": "Admin Tab.",
				"fr": "Supprimé (non nécessaire) onglet administrateur.",
				"it": "Rimossa (non necessaria) scheda di amministrazione.",
				"es": "Tapa de administración extraída (innecesaria).",
				"pl": "Przemieniona (nieunikniona) tablica adminowa.",
				"zh-cn": "删除(无必要)专注表。."
			},
			"1.3.7": {
				"en": "Updates to state translations (new values when SENEC turned off appliances), Added state definitions, Added high priority datapoints: temperatures, voltages, ... to better monitor safety relevant data",
				"de": "Aktualisierungen der State Übersetzungen (neue Werte durch die SENEC Problematik), Zustandsdefinitionen hinzugefügt, Datenpunkte mit hoher Priorität ergänzt: Temperaturen, Spannungen, ... um sicherheitsrelevante Daten besser zu überwachen",
				"ru": "Обновления государственных переводов (новые значения, когда SENEC отключила бытовую технику), Добавлены государственные определения, Добавлены высокие приоритетные данные: температуры, напряжения, ... для лучшего контроля безопасности соответствующих данных",
				"pt": "Atualizações às traduções estaduais (novos valores quando o SENEC desligou aparelhos), definições de estado adicionadas, pontos de dados de alta prioridade adicionados: temperaturas, tensões, ... para melhor monitorar dados relevantes de segurança",
				"nl": "Vertaling:",
				"fr": "Mises à jour des traductions d'état (nouvelles valeurs lorsque SENEC a éteint les appareils), Définitions d'état, Ajout de points de données hautement prioritaires: températures, tensions, ... pour mieux surveiller les données pertinentes de sécurité",
				"it": "Aggiornamenti alle traduzioni di stato (nuovi valori quando SENEC ha spento gli elettrodomestici), Aggiunte definizioni di stato, Aggiunto datapoint ad alta priorità: temperature, tensioni, ... per monitorare meglio la sicurezza dati rilevanti",
				"es": "Actualizaciones a las traducciones estatales (nuevos valores cuando SENEC apagó electrodomésticos), definiciones de estado agregadas, Puntos de datos de alta prioridad añadidos: temperaturas, voltajes, ... para monitorear mejor la seguridad datos relevantes",
				"pl": "Ulepszenia do tłumaczenia stanu (nowe wartości, kiedy SENEC odwrócił urządzenia), definicje państwowe, dodane wysoko priorytetowe punkty danych: temperatury, napięcia, ... aby lepiej monitorować odpowiednie dane danych",
				"zh-cn": "国家翻译的更新(新值在中欧经会脱离了配件),加上国家定义,加上高度优先的数据点:温度,火山,......以更好地监测安全相关数据"
			},
			"1.3.6": {
				"en": "fixed log.warning error",
				"de": "log.warning-Fehler behoben",
				"ru": "исправлена ошибка log.warning",
				"pt": "erro log.warning corrigido",
				"nl": "vaste log.waarschuwingsfout",
				"fr": "correction de l'erreur log.warning",
				"it": "errore log.warning corretto",
				"es": "error de advertencia de registro fijo",
				"pl": "naprawiony błąd log.warning",
				"zh-cn": "修复了 log.warning 错误"
			},
			"1.3.5-beta": {
				"en": "Added more state attributes (if you have updated descriptions or anything, please open an issue!), Workaround in case SENEC reports bogus request data",
				"de": "Weitere Beschreibungen für Datenpunkte hinzugefügt (wenn Sie hierzu Updates, fehlende Datenpunkte, etc haben, öffnen Sie bitte ein Ticket auf github; Problemumgehung für den Fall, dass SENEC gefälschte Anfragedaten meldet",
				"ru": "Добавлено больше атрибутов состояния (если вы обновили описания или что-то еще, пожалуйста, откройте проблему!), Обходной путь в случае, если SENEC сообщает о фиктивных данных запроса",
				"pt": "Adicionados mais atributos de estado (se você atualizou as descrições ou qualquer coisa, abra um problema!), Solução alternativa caso a SENEC relate dados de solicitação falsos",
				"nl": "Meer statusattributen toegevoegd (als je beschrijvingen hebt bijgewerkt of iets dergelijks, open dan een probleem!), Tijdelijke oplossing voor het geval SENEC valse verzoekgegevens meldt",
				"fr": "Ajout de plus d'attributs d'état (si vous avez mis à jour des descriptions ou quoi que ce soit, veuillez ouvrir un problème !), Solution de contournement au cas où SENEC signale de fausses données de demande",
				"it": "Aggiunti più attributi di stato (se hai descrizioni aggiornate o altro, apri un problema!), Soluzione alternativa nel caso in cui SENEC segnali dati di richiesta fasulli",
				"es": "Se agregaron más atributos de estado (si tiene descripciones actualizadas o algo, ¡abra un problema!), Solución alternativa en caso de que SENEC informe datos de solicitud falsos",
				"pl": "Dodano więcej atrybutów stanu (jeśli zaktualizowałeś opisy lub cokolwiek, otwórz problem!), Obejście w przypadku, gdy SENEC zgłosi fałszywe dane żądania",
				"zh-cn": "添加了更多的状态属性（如果您有更新的描述或任何内容，请打开一个问题！），以防 SENEC 报告虚假请求数据的解决方法"
			},
			"1.3.4": {
				"en": "Moved from request to axios, Added more state attributes (if you have updated descriptions or anything, please open an issue!)",
				"de": "Poll von request zu axios geändert, weitere Zustandsattribute hinzugefügt (wenn Sie aktuellere Beschreibungen, ... haben, bitte issue auf GitHub eröffnen!)",
				"ru": "Перемещено из запроса в аксиомы, добавлено больше атрибутов состояния (если вы обновили описания или что-то еще, пожалуйста, откройте проблему!)",
				"pt": "Movido de solicitação para axios, Adicionado mais atributos de estado (se você atualizou as descrições ou qualquer coisa, abra um problema!)",
				"nl": "Verplaatst van verzoek naar axios, meer statusattributen toegevoegd (als je beschrijvingen hebt bijgewerkt of iets dergelijks, open dan een probleem!)",
				"fr": "Déplacé de la demande vers axios, Ajout de plus d'attributs d'état (si vous avez des descriptions mises à jour ou quoi que ce soit, veuillez ouvrir un problème !)",
				"it": "Spostato da richiesta ad axios, Aggiunti più attributi di stato (se hai descrizioni aggiornate o altro, apri un problema!)",
				"es": "Se movió de solicitud a axios, se agregaron más atributos de estado (si tiene descripciones actualizadas o algo así, ¡abra un problema!)",
				"pl": "Przeniesiono z żądania do axios, dodano więcej atrybutów stanu (jeśli zaktualizowałeś opisy lub cokolwiek, otwórz zgłoszenie!)",
				"zh-cn": "从 request 移到 axios，添加了更多状态属性（如果您有更新的描述或任何内容，请打开一个问题！）"
			},
			"1.3.3": {
				"en": "Update to current template.",
				"de": "Update auf aktuelles Template.",
				"ru": "Обновите текущий шаблон.",
				"pt": "Atualize para o modelo atual.",
				"nl": "Update naar huidige sjabloon.",
				"fr": "Mettre à jour le modèle actuel.",
				"it": "Aggiorna al modello corrente.",
				"es": "Actualizar a la plantilla actual.",
				"pl": "Zaktualizuj do bieżącego szablonu.",
				"zh-cn": "更新到当前模板。"
			},
			"1.3.2": {
				"en": "Autarky without decimal places (again) or they would cause too many updates that are irrelevant especially when considering precision. Values also won't reset to 0 at change of timeframe (day, week, ...) anymore. They are calculated based on reference values anyways. Ensuring that only values meant to be changeable by user are defined so (attribute changes upon the next update of value)",
				"de": "Autarkie (wieder) ohne Dezimalstellen, da sie mehr Updates verursachen, als wirklich benötigt werden (insbesondere im Rahmen der Rundungsgenauigkeiten). Auch werden die Werte bei Änderung des Zeitrahmens (Tag, Woche, ...) nicht mehr forciert auf 0 zurückgesetzt, da sie ohnehin anhand von Referenzwerten berechnet werden. Es wird auch sichergestellt, dass nur Werte geändert werden können, die vom Benutzer geändert werden sollen (Attributänderungen bei der nächsten Wertaktualisierung).",
				"ru": "Автаркия без десятичных знаков (опять же). Они вызывают больше обновлений, чем нам действительно нужно. Значения автарки больше не сбрасываются на 0 при смене таймфрейма (день, неделя, ...). В любом случае они рассчитываются на основе справочных значений. Обеспечение того, чтобы были определены только значения, которые должны быть изменены пользователем (атрибут изменяется при следующем обновлении значения)",
				"pt": "Autarquia sem casas decimais (novamente). Eles estão causando mais atualizações do que realmente precisamos. Os valores da Autarky não serão mais zerados na mudança do período (dia, semana, ...). Eles são calculados com base em valores de referência de qualquer maneira. Garantir que apenas os valores que devem ser alterados pelo usuário sejam definidos assim (alterações de atributo na próxima atualização de valor)",
				"nl": "Autarkie zonder decimalen (opnieuw). Ze zorgen voor meer updates dan we echt nodig hebben. Autarky-waarden worden niet meer gereset naar 0 bij verandering van tijdsbestek (dag, week, ...). Ze worden sowieso berekend op basis van referentiewaarden. Ervoor zorgen dat alleen waarden die bedoeld zijn om door de gebruiker te kunnen worden gewijzigd, zo worden gedefinieerd (attribuut verandert bij de volgende update van waarde)",
				"fr": "Autarcie sans décimales (encore une fois). Ils provoquent plus de mises à jour que ce dont nous avons vraiment besoin. Les valeurs d'autarcie ne seront plus remises à 0 lors du changement de la période (jour, semaine, ...). Ils sont de toute façon calculés sur la base des valeurs de référence. S'assurer que seules les valeurs censées être modifiables par l'utilisateur sont définies ainsi (l'attribut change lors de la prochaine mise à jour de la valeur)",
				"it": "Autarchia senza cifre decimali (di nuovo). Stanno causando più aggiornamenti di quelli di cui abbiamo veramente bisogno. I valori di autarchia non si resetteranno più a 0 al cambio del periodo di tempo (giorno, settimana, ...). Sono comunque calcolati sulla base dei valori di riferimento. Garantire che solo i valori che devono essere modificabili dall'utente siano definiti in questo modo (l'attributo cambia al successivo aggiornamento del valore)",
				"es": "Autarquía sin decimales (de nuevo). Están provocando más actualizaciones de las que realmente necesitamos. Los valores de autarquía ya no se restablecerán a 0 al cambiar el período de tiempo (día, semana, ...). De todos modos, se calculan sobre la base de valores de referencia. Asegurarse de que solo se definan así los valores que el usuario puede cambiar (el atributo cambia en la próxima actualización del valor)",
				"pl": "Autarkia bez miejsc dziesiętnych (ponownie). Powodują więcej aktualizacji, niż naprawdę potrzebujemy. Wartości autarkii nie będą już resetowane do 0 przy zmianie przedziału czasowego (dzień, tydzień, ...). Są one i tak obliczane na podstawie wartości referencyjnych. Zapewnienie, że tylko wartości, które mają być zmieniane przez użytkownika, są tak zdefiniowane (atrybut zmienia się przy następnej aktualizacji wartości)",
				"zh-cn": "再次没有小数位的Autarky。它们造成的更新超出了我们的实际需要。 Autarky值将不会在时间范围（天，周，...）更改时重置为0。无论如何，它们都是基于参考值计算的。确保仅定义要由用户更改的值（在值的下一次更新时归因于更改）"
			}
        },
        "docs": {
            "en": "docs/en/README.md",
            "de": "docs/de/README.md"
        },
        "title": "Senec",
        "titleLang": {
            "en": "Senec",
            "de": "Senec",
            "ru": "Senec",
            "pt": "Senec",
            "nl": "Senec",
            "fr": "Senec",
            "it": "Senec",
            "es": "Senec",
            "pl": "Senec",
            "zh-cn": "塞内克"
        },
        "desc": {
            "en": "This adapter reads available values from a Senec Home V2.1 system using lala.cgi.",
            "de": "Dieser Adapter liest die in einem Senec Home V2.1 verfügbaren Werte via lala.cgi aus."
        },
        "authors": [
            "NoBl <github@bluemle.org>"
        ],
        "keywords": [
            "iobroker",
            "senec",
            "solar"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "senec.png",
        "enabled": false,
        "extIcon": "https://raw.githubusercontent.com/nobl/ioBroker.senec/master/admin/senec.png",
        "readme": "https://github.com/nobl/ioBroker.senec/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "energy",
		"connectionType": "local",
	    "dataSource": "poll",
		"compact": true,
		"materialize": true,
		"materializeTab": false,
		"supportCustoms": false,
        "dependencies": [
			{
                "js-controller": ">=2.0.0"
            }
        ]
    },
    "native": {
        "senecip": "0.0.0.0",
        "interval": 10,
		"intervalLow": 60,
		"pollingTimeout": 5000,
		"retries": 10,
		"retrymultiplier": 2
    },
    "objects": [],
    "instanceObjects": [{
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        }, {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Device or service connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
