{
    "common": {
        "name": "senec",
        "version": "1.6.5",
        "news": {
			"1.6.5": {
				"en": "Added AllTime Statistics (trigger initial calculations in adapter settings), https is now default for new instances.",
				"de": "AllTime Statistiken hinzugefügt (initiale Berechnung bitte in den Adapter-Einstellungen aktivieren), https ist jetzt Standard für neue Instanzen.",
				"ru": "Добавлена статистика AllTime (trigger начальные расчеты в настройках адаптера), https теперь по умолчанию для новых инстанций.",
				"pt": "Adicionado AllTime Statistics ( cálculos iniciais de gatilho em configurações de adaptador), https agora é padrão para novas instâncias.",
				"nl": "Toegevoegd AllTime Statistieken (trigger initialen berekeningen in adapter settings\" \"htps is nu default voor nieuwe instanties.",
				"fr": "Ajout de AllTime Statistics (trigger initial calculations in adapt settings), https est maintenant par défaut pour de nouveaux cas.",
				"it": "Aggiunta AllTime Statistics (configurazioni iniziali del trigger nelle impostazioni dell'adattatore), https è ora predefinito per nuove istanze.",
				"es": "Añadido AllTime Statistics (trigger inicial calculations in adapter settings), https ahora es predeterminado para nuevas instancias.",
				"pl": "Added AllTime Statistics (trigger początkowych obliczeń w ustawieniach adapterów), https jest obecnie domyślny do nowych instancji.",
				"uk": "Додано AllTime Статистика (тригер початкових обчислень в налаштуваннях адаптера), HTTPS тепер за замовчуванням для нових екземплярів.",
				"zh-cn": "加上《所有制度统计》(在适应环境中的过份初步计算),目前,新情况目前有缺陷。."
			},
			"1.6.4": {
				"en": "Numbers are numbers again",
				"de": "Zahlen sind wieder Zahlen",
				"ru": "Номера снова",
				"pt": "Os números são números novamente",
				"nl": "Nummers zijn weer getallen",
				"fr": "Les nombres sont de nouveau des nombres",
				"it": "I numeri sono di nuovo numeri",
				"es": "Números son números de nuevo",
				"pl": "Liczby są ponownie numerami",
				"uk": "Кількість чисел знову",
				"zh-cn": "数字再次编号"
			},
			"1.6.3": {
				"en": "Bugfixes for API reading.",
				"de": "Bugfixes im API Handling.",
				"ru": "Bugfixes для чтения API.",
				"pt": "Bugfixes para leitura de API.",
				"nl": "Bugfixes voor API-lezing.",
				"fr": "Bugfixes pour la lecture de l'API.",
				"it": "Bugfixes per la lettura API.",
				"es": "Bugfixes para la lectura de API.",
				"pl": "Bugfixes for API reading (ang.).",
				"uk": "Виправлення помилок для читання API.",
				"zh-cn": "评 注."
			},
			"1.6.2": {
				"en": "Added statistics values from API along with some own calculations.",
				"de": "Statistikwerte von API zusammen mit einigen eigenen Berechnungen hinzugefügt.",
				"ru": "Добавлены статистические значения из API наряду с некоторыми собственными расчетами.",
				"pt": "Adicionados valores estatísticos da API junto com alguns próprios cálculos.",
				"nl": "Voeg statistieken toe van API samen met wat eigen berekeningen.",
				"fr": "Ajout des valeurs statistiques de l'API avec certains propres calculs.",
				"it": "Aggiunti i valori statistici da API con alcuni propri calcoli.",
				"es": "Valores estadísticos añadidos de API junto con algunos cálculos propios.",
				"pl": "Wstępne dane z API wraz z kilkoma własnymi obliczeniami.",
				"uk": "Додано значення статистичних даних з API разом з деякими власними підрахунками.",
				"zh-cn": "加上非传染性疾病的统计价值以及一些本身的计算。."
			},
			"1.6.1": {
				"en": "Bugfixes for API reading.",
				"de": "Bugfixes im API Handling.",
				"ru": "Bugfixes для чтения API.",
				"pt": "Bugfixes para leitura de API.",
				"nl": "Bugfixes voor API-lezing.",
				"fr": "Bugfixes pour la lecture de l'API.",
				"it": "Bugfixes per la lettura API.",
				"es": "Bugfixes para la lectura de API.",
				"pl": "Bugfixes for API reading (ang.).",
				"uk": "Виправлення помилок для читання API.",
				"zh-cn": "评 注."
			},
			"1.6.0": {
				"en": "You can now configure to request SENEC App API.",
				"de": "Sie können nun die SENEC App API abfragen.",
				"ru": "Теперь вы можете настроить для запроса SENEC App API.",
				"pt": "Agora você pode configurar para solicitar a API do SENEC App.",
				"nl": "Je kunt nu configureren om SENEC App API te vragen.",
				"fr": "Vous pouvez maintenant configurer pour demander l'API App SENEC.",
				"it": "Ora è possibile configurare per richiedere l'API SENEC App.",
				"es": "Ahora puede configurarse para solicitar SENEC App API.",
				"pl": "Możesz teraz skonfigurować żądanie SENEC App API.",
				"uk": "Ви можете налаштувати запит на SENEC App API.",
				"zh-cn": "如今,你可以准备要求SENECSP。."
			},
			"1.5.2": {
				"en": "Added more datapoints. If you experience messages in log - feel free to add them yourself to state_attr on github (pull request)",
				"de": "Weitere Datenpunkte hinzugefügt. Du kennst weitere? Bitte PullRequest auf Github für state_attr.",
				"ru": "Добавили больше точек данных. Если вы испытываете сообщения в логе - не стесняйтесь добавлять их самостоятельно в state_attr на github (по запросу)",
				"pt": "Adicionado mais datapoints. Se você tiver mensagens no log - sinta-se livre para adicioná-las ao state_attr no github (requisito de envio)",
				"nl": "Voegde meer datapoints toe. Als je berichten in het logboek ervaart, voel je vrij om ze zelf toe te voegen aan github (pull verzoek)",
				"fr": "Ajout d'autres points de données. Si vous éprouvez des messages dans log - n'hésitez pas à les ajouter à state_attr sur github (demande de puissance)",
				"it": "Aggiunti altri datapoint. Se si verificano messaggi in log - sentitevi liberi di aggiungerli a state_attr su github (domanda di voto)",
				"es": "Se agregaron más puntos de datos. Si experimentas mensajes en el registro - no dudes en añadirlos a state_attr en github (pregunta completa)",
				"pl": "Dodać więcej danych. Jeśli znajdziesz wiadomości w dzienniku – czuje się wolny, aby dodać ich do stanu_attr na github (pułki)",
				"uk": "Додано більше точок даних. Якщо ви відчуваєте повідомлення в журналі - не соромтеся додати їх до стану_attr на github",
				"zh-cn": "增加数据点。 如果你在逻辑上有信息,就认为可以自由地补充你自己的国家:对Tithub(要求)表示怀疑。"
			},
			"1.5.1": {
				"en": "Added more datapoints. If you experience messages in log - feel free to add them yourself to state_attr on github (pull request)",
				"de": "Weitere Datenpunkte hinzugefügt. Du kennst weitere? Bitte PullRequest auf Github für state_attr.",
				"ru": "Добавили больше точек данных. Если вы испытываете сообщения в логе - не стесняйтесь добавлять их самостоятельно в state_attr на github (по запросу)",
				"pt": "Adicionado mais datapoints. Se você tiver mensagens no log - sinta-se livre para adicioná-las ao state_attr no github (requisito de envio)",
				"nl": "Voegde meer datapoints toe. Als je berichten in het logboek ervaart, voel je vrij om ze zelf toe te voegen aan github (pull verzoek)",
				"fr": "Ajout d'autres points de données. Si vous éprouvez des messages dans log - n'hésitez pas à les ajouter à state_attr sur github (demande de puissance)",
				"it": "Aggiunti altri datapoint. Se si verificano messaggi in log - sentitevi liberi di aggiungerli a state_attr su github (domanda di voto)",
				"es": "Se agregaron más puntos de datos. Si experimentas mensajes en el registro - no dudes en añadirlos a state_attr en github (pregunta completa)",
				"pl": "Dodać więcej danych. Jeśli znajdziesz wiadomości w dzienniku – czuje się wolny, aby dodać ich do stanu_attr na github (pułki)",
				"uk": "Додано більше точок даних. Якщо ви відчуваєте повідомлення в журналі - не соромтеся додати їх до стану_attr на github",
				"zh-cn": "增加数据点。 如果你在逻辑上有信息,就认为可以自由地补充你自己的国家:对Tithub(要求)表示怀疑。"
			},
			"1.5.0": {
				"en": "Added configuration section to add datapoints to high priority polling. Please be aware of the possible issues this could cause (if too many datapoints added) and use at your own risk. ALL Wallbox datapoints have been removed from high priority polling. Only some users even have a SENEC wallbox. Please reconfigure via the new config dialogue. Possible Candidate for stable. Please report any findings!",
				"de": "Konfigurationsabschnitt hinzugefügt, um zusätzliche Datenpunkte mit hoher Priorität abzufragen. Bitte beachten Sie die möglichen Probleme, die dies verursachen könnte (wenn zu viele Datenpunkte hinzugefügt wurden). Nutzung auf eigenes Risiko. Standardgemäß werden nun keine Wallbox-Datenpunkte mehr mit hoher Priorität abgefragt (zu wenige User haben eine SENEC Wallbox). Diese nun bitte über den neuen Configdialog konfigurieren. Möglicher Kandidat für stable - bitte alle Probleme reporten.",
				"ru": "Добавлен раздел конфигурации, чтобы добавить данные точки к высокому приоритетному опросу. Пожалуйста, имейте в виду возможные проблемы, которые могут вызвать (если слишком много добавленных данных) и использовать на вашем собственном риске. Все точки данных Wallbox были удалены из высококачественного опроса. Только некоторые пользователи даже имеют SENEC wallbox. Пожалуйста, обратите внимание на новый диалог.",
				"pt": "Seção de configuração adicionada para adicionar datapoints a votação de alta prioridade. Por favor, esteja ciente dos possíveis problemas que isso poderia causar (se muitos datapoints adicionados) e usar em seu próprio risco. TODOS os datapoints da Wallbox foram removidos da votação de alta prioridade. Apenas alguns usuários têm uma caixa de parede SENEC. Por favor, reconfigure através do novo diálogo de configuração.",
				"nl": "Toegevoegd configuration sectie om gegevens toe te voegen aan hoge prioriteitsvervuiling. Wees alsjeblieft op de hoogte van de mogelijke kwesties die dit kan veroorzaken... als te veel datapoints toegevoegd zijn en gebruik maken van je eigen risico. Alle Wallbox datapoints zijn verwijderd van hoge prioriteitsvervuiling. Alleen sommige gebruikers hebben zelfs een SENEC muurdoos. Herconfiguur via de nieuwe dialoog.",
				"fr": "Ajout de la section de configuration pour ajouter des points de données à un sondage prioritaire. S'il vous plaît être conscient des problèmes possibles qui pourraient causer (si trop de points de données ajoutés) et utiliser à vos propres risques. Tous les points de données de Wallbox ont été retirés du vote prioritaire. Seuls certains utilisateurs ont même une boîte murale SENEC. Veuillez reconfigurer via le nouveau dialogue de configuration.",
				"it": "Aggiunta sezione di configurazione per aggiungere datapoints ad inquinamento ad alta priorità. Si prega di essere consapevoli dei possibili problemi che questo potrebbe causare (se troppi punti di dati aggiunti) e utilizzare a proprio rischio. Tutti i datapoint di Wallbox sono stati rimossi dall'inquinamento ad alta priorità. Solo alcuni utenti hanno anche una parete SENEC. Si prega di riconfigurare tramite il nuovo dialogo di configurazione.",
				"es": "Se agregó la sección de configuración para añadir puntos de datos a encuestas de alta prioridad. Tenga en cuenta los posibles problemas que esto podría causar (si se añaden demasiados datos) y utilizar a su propio riesgo. Todos los puntos de datos de Wallbox han sido eliminados de encuestas de alta prioridad. Sólo algunos usuarios tienen una caja de pared SENEC. Por favor reconfigure a través del nuevo diálogo de configuración.",
				"pl": "Wtedy sekcja konfiguracji dodania punktów danych do wysokiego priorytetu. Poświadczenie o możliwych zagadnieniach może powodować (jeśli są zbyt wiele punktów danych) i wykorzystać swój własny ryzyko. ALL Wallbox datapoints zostały usunięte z wysokiego priorytetu. Tylko niektórzy użytkownicy mają nawet SENEC. Powraca się poprzez nowe dialogi.",
				"uk": "Додано розділ конфігурації, щоб додати точки даних до високого пріоритетного опитування. Будь ласка, будь ласка, будь ласка, будь ласка, зв'яжіться з нами та користуйтеся власним ризиком. Усі точки даних Wallbox видаляються з високого  пріоритетного опитування. Тільки деякі користувачі навіть мають скриньку SENEC. Будь ласка, переадресація через новий діалог налаштування.",
				"zh-cn": "增加数据点以进行高度优先投票。 请了解可能出现的问题(如果数据点增加),并利用你自己的风险。 已从高优先投票中删除了所有Wil箱数据点。 只有一些用户甚至有SENEC墙箱。 请通过新的混凝土对话进行改组。."
			},
			"1.4.3": {
				"en": "Working on https connection. Please test and report!",
				"de": "Arbeiten an https-Verbindung. Bitte testen und melden!",
				"ru": "Работает на связи https. Пожалуйста, проверьте и сообщите!",
				"pt": "A trabalhar na ligação https. Por favor, teste e informe!",
				"nl": "Werken aan HTP's verbinding. test en rapporteer!",
				"fr": "Travailler sur la connexion https. S'il vous plaît tester et rapporter!",
				"it": "Lavorare sul collegamento https. Si prega di testare e segnalare!",
				"es": "Trabajando en la conexión https. ¡Por favor, prueba e informe!",
				"pl": "Pracuje nad połączeniem https. Protestować i sprawdzić!",
				"uk": "Робота на підключення HTTPS. Будь ласка, перевірте та звітуйте!",
				"zh-cn": "关于网址的工作。 请试验和报告!"
			},
			"1.4.2": {
				"en": "Added option to use https for connecting to SENEC (only activate if your appliance supports / requires this!)",
				"de": "Zusätzliche Option zur Verwendung von https zur Verbindung mit SENEC hinzugefügt (nur aktivieren, wenn Ihr Gerät dies unterstützt / erfordert)",
				"ru": "Добавлена возможность использования https для подключения к SENEC (только активируйте, если ваше приложение поддерживает / требует этого)",
				"pt": "Adicionado opção para usar https para conectar-se ao SENEC (apenas ativar se o seu aparelho suporta / requer este)",
				"nl": "Aangepaste optie om HTP's te gebruiken voor verbinding met SENEC (only geactiveerd als je appliance steunt / vereist dit",
				"fr": "Ajout de l'option d'utiliser les https pour se connecter à SENEC (seulement activer si votre appareil prend en charge / nécessite ceci) ",
				"it": "Aggiunta opzione per utilizzare https per il collegamento a SENEC (solo attivare se il tuo elettrodomestici supporta / richiede questo)",
				"es": "Opción agregada para usar https para conectarse a SENEC (sólo activar si su dispositivo soporta / requiere esto)",
				"pl": "Dodana opcja do używania https dla połączenia z SENEC (w sposób aktywowana, jeśli dana osoba obsługuje / wymaga to)",
				"uk": "Додано можливість використовувати HTTPS для підключення до SENEC (тільки активуйте, якщо підтримує додаток / вимагає цього)",
				"zh-cn": "增加使用连接到SENEC的网站的选择(如果你的可靠支持/要求这样做)"
			}
        },
        "docs": {
            "en": "docs/en/README.md",
            "de": "docs/de/README.md"
        },
        "titleLang": {
            "en": "Senec",
            "de": "Senec",
            "ru": "Senec",
            "pt": "Senec",
            "nl": "Senec",
            "fr": "Senec",
            "it": "Senec",
            "es": "Senec",
            "pl": "Senec",
			"uk": "Senec",
            "zh-cn": "塞内克"
        },
        "desc": {
            "en": "This adapter reads available values from a Senec Home V2.1 (and later) system using lala.cgi",
			"de": "Dieser Adapter liest verfügbare Werte von einem Senec Home V2.1 (und später) System mit lala.cgi",
			"ru": "Этот адаптер считывает доступные значения от системы Senec Home V2.1 (и позже) с помощью lala.cgi",
			"pt": "Este adaptador lê valores disponíveis de um sistema Senec Home V2.1 (e posterior) usando lala.cgi",
			"nl": "Deze adapter leest beschikbare waarden van een Senec Home V21 (en later) systeem met lala",
			"fr": "Cet adaptateur lit les valeurs disponibles d'un système Senec Home V2.1 (et plus tard) utilisant lala.cgi",
			"it": "Questo adattatore legge i valori disponibili da un sistema Senec Home V2.1 (e successivamente) utilizzando lala.cgi",
			"es": "Este adaptador lee los valores disponibles de un sistema Senec Home V2.1 (y más tarde) usando lala.cgi",
			"pl": "Ta adapter przeczytała dostępne wartości z systemu Senec Home V2.1 (a później) używając lala.cgi",
			"uk": "Цей адаптер зчитуває доступні значення від Senec Home V2.1 (і пізніше) системи за допомогою lala.cgi",
			"zh-cn": "这种适应者从Senec Home V2.1(和以后)利用Fla.cgi阅读了可使用的数值。"
        },
        "authors": [
            "NoBl <github@bluemle.org>"
        ],
        "keywords": [
            "senec",
            "solar"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "senec.png",
        "enabled": false,
        "extIcon": "https://raw.githubusercontent.com/nobl/ioBroker.senec/master/admin/senec.png",
        "readme": "https://github.com/nobl/ioBroker.senec/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "energy",
		"compact": true,
		"connectionType": "local",
	    "dataSource": "poll",
		"adminUI": {
			"config": "json"
		},
        "dependencies": [
			{
                "js-controller": ">=4.0.0"
            }
        ],
	        "globalDependencies": [
	            {
	                "admin": ">=5.1.13"
	            }
	        ]
    },
    "native": {
        "senecip": "0.0.0.0",
        "interval": 10,
		"intervalLow": 60,
		"pollingTimeout": 5000,
		"retries": 10,
		"retrymultiplier": 2,
		"useHttps": true,
		"disclaimer": false,
		"highPrio_BMS": "",
		"highPrio_BMS_active": false,
		"highPrio_ENERGY": "",
		"highPrio_ENERGY_active": false,
		"highPrio_PV1": "",
		"highPrio_PV1_active": false,
		"highPrio_PWR_UNIT": "",
		"highPrio_PWR_UNIT_active": false,
		"highPrio_PM1OBJ1": "",
		"highPrio_PM1OBJ1_active": false,
		"highPrio_PM1OBJ2": "",
		"highPrio_PM1OBJ2_active": false,
		"highPrio_WALLBOX": "",
		"highPrio_WALLBOX_active": false,
		"highPrio_BAT1": "",
		"highPrio_BAT1_active": false,
		"highPrio_BAT1OBJ1": "",
		"highPrio_BAT1OBJ1_active": false,
		"highPrio_TEMPMEASURE": "",
		"highPrio_TEMPMEASURE_active": false,
		"api_use": false,
		"api_interval": 5,
		"api_alltimeRebuild": false
    },
	"nativeEncrypted": {
        "api_mail": "",
        "api_pwd": ""
    },
    "objects": [],
    "instanceObjects": [{
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        }, {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Device or service connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
